{
    "about": {
      "name": "Yufan Zhang",
      "title": "Full Stack Software Engineer",
      "tagline": "I build AI-integrated applications and scalable backend systems.",
      "paragraphs": [
        "I'm a full stack software engineer with a focus on backend development and AI-integrated systems. I enjoy building products that are both technically robust and practically useful — from clean REST APIs to intelligent automation workflows.",
        "Most recently, I worked at Flowing Bee, where I designed and built an AI automation system using Azure OpenAI that reduced processing time from 30 days to 24 hours. I also architected a multi-agent workflow with automated quality checks and implemented secure authentication across the platform.",
        "I'm currently completing my Master of Information Technology (Artificial Intelligence) at the University of Melbourne."
      ]
    },
    "experience": [
      {
        "period": "Nov 2024 - Feb 2025",
        "company": "Flowing Bee",
        "role": "Software Engineer",
        "url": {
          "github": null,
          "live": null
        },
        "bullets": [
          "Built an AI automation system using Azure OpenAI, reducing processing time from 30 days to 24 hours",
          "Designed multi-agent workflow architecture with automated quality checks and smart routing",
          "Developed admin panel with full CRUD for user and organisation management",
          "Implemented OIDC authentication and role-based authorization in FastAPI",
          "Applied TDD achieving 90%+ test coverage for security modules"
        ],
        "techStack": ["FastAPI", "React", "Azure OpenAI", "Docker"]
      }
    ],
    "projects": [
      {
        "name": "Glucope - Diabetic Patient Management",
        "year": "2024",
        "description": "A web-based patient management application supporting daily workflows for patients and clinicians, deployed to Azure and AWS.",
        "techStack": ["Node.js", "Express", "HTML", "CSS", "JavaScript"],
        "url": {
          "github": null,
          "live": null
        }
      },
      {
        "name": "Microservices Shopping Backend",
        "year": "2024",
        "description": "Backend microservices system supporting core e-commerce workflows with inter-service communication and order processing.",
        "techStack": [".NET Core", "PostgreSQL", "REST API"],
        "url": {
          "github": null,
          "live": null
        }
      }
    ]
  }